Repository: elaine950619/Aligna_frontend
Catalog: AlignaTest/Localizable.xcstrings
Source language: en
Languages: zh_hans

# profile.language_partial_badge
source: Partial support
zh_hans: 部分支持

# profile.language_partial_confirm
source: Switch Anyway
zh_hans: 仍要切换

# profile.language_partial_message
source: Simplified Chinese is currently partially supported. Some content may still appear in English. Would you like to switch anyway?
zh_hans: 简体中文目前仅部分支持，部分内容可能仍以英文显示。是否仍要切换？

# profile.language_partial_title
source: Partial Support
zh_hans: 部分支持

# profile.language_restart_message
source: Please restart the app for the language change to take effect.
zh_hans: 请重启应用以使语言更改生效。

# profile.language_restart_ok
source: Got it
zh_hans: 知道了

# profile.language_restart_title
source: Restart Required
zh_hans: 需要重启

# profile.location_access_subtitle
source: Improves your rhythm and mantra guidance
zh_hans: 改善你的节律与心语引导

# profile.location_access_title
source: Location Access
zh_hans: 位置权限

# profile.location_dialog_message
source: Location helps us understand your local context, including weather, humidity, pressure, and nearby environmental patterns such as greenery and built surroundings. We store this information only to support your recommendations and continuity across the app. We do not share your location with other users or third parties. If iOS opens the app settings page first, go to Location, then choose While Using the App or Always.
zh_hans: 位置信息帮助我们了解你所在地的环境，包括天气、湿度、气压，以及附近的植被与建筑环境。 我们仅将此信息用于支持你的推荐与应用连贯性，不会与其他用户或第三方共享你的位置。 如果 iOS 先打开应用设置页，请前往「位置」，选择「使用期间」或「始终」。

# profile.location_dialog_title
source: Location Access
zh_hans: 位置权限

# profile.location_error_title
source: Location Error
zh_hans: 位置错误

# profile.location_off_hint
source: Location access is off. Tap to review details or open Settings.
zh_hans: 位置权限已关闭。点击查看详情或前往设置。

# profile.location_save_failed_title
source: Save Failed
zh_hans: 保存失败

# profile.location_timeout_message
source: Exceed 10 seconds, please try again.
zh_hans: 超过十秒，请重试。

# profile.location_timeout_title
source: Location Timeout
zh_hans: 位置获取超时

# profile.location_unchanged_title
source: Location unchanged.（Still at：%@）
zh_hans: 位置未变更。（仍在：%@）

# profile.location_updated_message
source: Updated to：%@
zh_hans: 已更新至：%@

# profile.location_updated_title
source: Location Updated
zh_hans: 位置已更新

# profile.missing_nonce
source: Missing nonce. Please try again.
zh_hans: 验证令牌丢失，请重试。

# profile.nickname_placeholder
source: Nickname
zh_hans: 昵称

# profile.no_account
source: Don't have an account?
zh_hans: 还没有账户？

# profile.not_now
source: Not Now
zh_hans: 暂不

# profile.notification_subtitle
source: Reminded at sunrise & sunset
zh_hans: 在日出与日落时提醒

# profile.notification_title
source: Daily Reminders
zh_hans: 每日提醒

# profile.notifications_off_hint
source: Notifications are off. Tap to enable in Settings.
zh_hans: 通知已关闭。点击前往设置中启用。

# profile.open_settings
source: Open Settings
zh_hans: 打开设置

# profile.or_continue
source: Or continue with
zh_hans: 或继续使用

# profile.password_placeholder
source: Enter your password
zh_hans: 输入你的密码

# profile.password_reset_sent
source: Password reset email sent.
zh_hans: 密码重置邮件已发送。

# profile.personal_info_subtitle
source: Tap the lock to reveal the details.
zh_hans: 点击锁标以查看详情。

# profile.personal_info_title
source: Personal Information
zh_hans: 个人信息

# profile.preferences_subtitle
source: Update your scent, color & more
zh_hans: 更新你的气味、颜色等偏好

# profile.preferences_title
source: Preferences
zh_hans: 偏好

# profile.relationship_in_relationship
source: In a relationship
zh_hans: 恋爱中

# profile.relationship_single
source: Single
zh_hans: 单身

# profile.save_button
source: Save
zh_hans: 保存

# profile.show_personal_info
source: Show personal information
zh_hans: 显示个人信息

# profile.sign_out_subtitle
source: Sign out of your account
zh_hans: 退出当前账户

# profile.sign_out_title
source: Sign out
zh_hans: 退出登录

# profile.signing_in
source: Signing in...
zh_hans: 正在登录...

# profile.theme_adaptive
source: Adaptive
zh_hans: 随节律

# profile.theme_dawn
source: Dawn
zh_hans: 晨曦

# profile.theme_dusk
source: Dusk
zh_hans: 暮色

# profile.theme_love
source: Love
zh_hans: 爱意

# profile.theme_rain
source: Rain
zh_hans: 细雨

# profile.theme_subtitle
source: Customize appearance
zh_hans: 自定义外观

# profile.theme_title
source: Theme
zh_hans: 主题

# profile.theme_vitality
source: Vitality
zh_hans: 生命力

# profile.timeline_subtitle
source: View your rhythm journey
zh_hans: 查看你的节律旅程

# profile.timeline_title
source: Timeline
zh_hans: 时光轴

# profile.welcome_back
source: Welcome Back
zh_hans: 欢迎回来

# profile.welcome_subtitle
source: Return to your journal, your rituals, and today's guidance.
zh_hans: 回到你的日记、仪式和今天的指引。

# profile.zodiac_asc_desc
source: Your outward presence and how others perceive you
zh_hans: 你的外在形象与他人对你的感知

# profile.zodiac_info_dismiss
source: Got it
zh_hans: 知道了

# profile.zodiac_info_title
source: Your Three Signs
zh_hans: 你的星盘

# profile.zodiac_moon_desc
source: Your emotional world and inner needs
zh_hans: 你的情感世界与内在需求

# profile.zodiac_sun_desc
source: Your core self and life energy
zh_hans: 你的核心自我与生命能量

# progress.completed_count
source: %lld of %lld actions done
zh_hans: 已完成 %lld / %lld 项行动

# progress.encourage_all
source: All done. On %@, you've built something real today.
zh_hans: 今日行动全部完成。你在「%@」这个课题上，今天积累了真实的改变。

# progress.encourage_partial
source: On %@, you're building real change — one action at a time.
zh_hans: 你在「%@」这个课题上，正在积累真实的改变。

source: Reasoning summary bubble
zh_hans: 推理摘要气泡

source: Refresh
zh_hans: 刷新

source: Refresh %@
zh_hans: 刷新 %@

source: Retry
zh_hans: 重试

source: Save
zh_hans: 保存

source: Saved to Photos
zh_hans: 已保存到相册

source: Share
zh_hans: 分享

source: Share Failed
zh_hans: 分享失败

source: Show up to 3 focuses under the mantra. Remove one first to add another.
zh_hans: 心语下方最多显示三个主题，请先移除一个再添加。

source: Shows why this mantra was chosen
zh_hans: 显示选择此心语的原因

# signup.create_account
source: Create account
zh_hans: 注册账号

# signup.create_your_space
source: Create your space
zh_hans: 创建你的空间

# signup.creating
source: Creating…
zh_hans: 创建中…

# signup.dialog_cancel
source: Cancel
zh_hans: 取消

# signup.dialog_i_verified
source: I've verified
zh_hans: 我已验证

# signup.dialog_notice_title
source: Notice
zh_hans: 提示

# signup.dialog_resend
source: Resend email
zh_hans: 重新发送

# signup.dialog_signin_title
source: Account already exists
zh_hans: 账号已存在

# signup.dialog_verify_title
source: Verify your email
zh_hans: 请验证邮箱

# signup.error_fill_fields
source: Please fill in all fields.
zh_hans: 请填写所有字段。

# signup.error_not_verified
source: Your email is not yet verified. Please check your inbox.
zh_hans: 邮箱尚未验证，请查收邮件。

# signup.error_session_expired
source: Session expired. Please try again.
zh_hans: 会话已过期，请重试。

# signup.error_sign_in_failed
source: Sign-in failed. Please try again.
zh_hans: 登录失败，请重试。

# signup.overlay_checking
source: Checking…
zh_hans: 检查中…

# signup.overlay_signing_up
source: Signing up…
zh_hans: 注册中…

# signup.session_expired_goto_login
source: Session expired. Please go to the login page.
zh_hans: 会话已过期，请返回登录页。

# signup.sign_up_google
source: Sign up with Google
zh_hans: 通过 Google 注册

# signup.verify_email_sent
source: Verification email sent. Please check your inbox.
zh_hans: 验证邮件已发送，请查收邮箱。

source: Sound Key
zh_hans: 声音关键词

source: Sun sign
zh_hans: 太阳星座

source: That focus already exists.
zh_hans: 该主题已存在。

source: The %@ mantra request did not finish successfully.
zh_hans: %@ 心语请求未能成功完成。

source: The %@ mantra response was incomplete.
zh_hans: %@ 心语响应不完整。

source: Theme
zh_hans: 主题

source: This deletes %@ everywhere it appears and clears its cached focused mantra.
zh_hans: 这将删除所有出现 %@ 的地方，并清除其缓存的主题心语。

# timeline.action_how
source: How to engage
zh_hans: 如何执行

# timeline.action_why
source: Why this is recommended
zh_hans: 为什么推荐

# timeline.header_title
source: Timeline
zh_hans: 时光轴

# timeline.last_entry
source: Last entry
zh_hans: 最近一条

# timeline.loading
source: Loading…
zh_hans: 加载中…

# timeline.mantra_placeholder
source: Your daily mantra will appear here.
zh_hans: 今日心语将在这里显示。

# timeline.no_actions
source: No actions for this day
zh_hans: 今日暂无行动

# timeline.no_data
source: No data available for this day
zh_hans: 当天暂无数据

# timeline.no_entry
source: No entry yet.
zh_hans: 暂无日记。

# timeline.no_mantra
source: No mantra for this day.
zh_hans: 当天暂无心语生成。

# timeline.no_overview
source: No overview available.
zh_hans: 暂无简介。

# timeline.section_actions
source: Actions
zh_hans: 行动

# timeline.section_mantra
source: Mantra
zh_hans: 心语

# timeline.section_notes
source: Notes
zh_hans: 笔记

# timeline.section_rhythm
source: Rhythm
zh_hans: 节律

# timeline.streak_days
source: %lld days in a row
zh_hans: 连续记录 %lld 天

source: Toggle Widget Sound
zh_hans: 切换小组件声音

source: Turn on Location Access in Settings. Alynna uses weather, humidity, pressure, and nearby conditions to calculate your mantra and rhythm.
zh_hans: 请在设置中开启位置访问权限。Alynna 会利用天气、湿度、气压及周边环境状况来计算你的心语与节奏。

source: Turn on Location Access in Settings. Alynna uses weather, humidity, pressure, and nearby conditions to shape your %@ mantra.
zh_hans: 请在设置中开启位置访问权限。Alynna 会利用天气、湿度、气压及周边环境状况来塑造你的 %@ 心语。

source: Unable to prepare this focus mantra request.
zh_hans: 无法准备此心语请求。

source: Unable to start the focus mantra request right now.
zh_hans: 当前无法发起主题心语请求。

source: Update Unavailable
zh_hans: 暂时无法更新

source: Updated for today
zh_hans: 已更新今日内容

source: We're shaping a mantra around %@ and today's signals.
zh_hans: 正在围绕「%@」和今日信号塑造心语。

source: We're weaving together your cosmic, environmental, and personal signals.
zh_hans: 正在整合你的星象、环境与个人信号。

# weather.clear
source: Clear sky
zh_hans: 晴

# weather.cloudy
source: Cloudy
zh_hans: 多云

# weather.drizzle
source: Drizzle
zh_hans: 毛毛雨

# weather.foggy
source: Foggy
zh_hans: 雾

# weather.heavy_rain
source: Heavy rain
zh_hans: 大雨

# weather.heavy_showers
source: Heavy showers
zh_hans: 强阵雨

# weather.heavy_snow
source: Heavy snow
zh_hans: 大雪

# weather.light_drizzle
source: Light drizzle
zh_hans: 小毛毛雨

# weather.light_rain
source: Light rain
zh_hans: 小雨

# weather.light_snow
source: Light snow
zh_hans: 小雪

# weather.mixed
source: Mixed conditions
zh_hans: 天气多变

# weather.moderate_rain
source: Moderate rain
zh_hans: 中雨

# weather.moderate_showers
source: Moderate showers
zh_hans: 中阵雨

# weather.moderate_snow
source: Moderate snow
zh_hans: 中雪

# weather.mostly_clear
source: Mostly clear
zh_hans: 大部晴朗

# weather.partly_cloudy
source: Partly cloudy
zh_hans: 局部多云

# weather.showers
source: Showers
zh_hans: 阵雨

# weather.thunderstorm
source: Thunderstorm
zh_hans: 雷阵雨

source: What should this focus hold space for?
zh_hans: 这个主题应该关注什么？

# wrapup.cta
source: Start today
zh_hans: 开始今天

# wrapup.progress_all
source: All done. On %@, you truly showed up.
zh_hans: 上次行动全部完成。你在「%@」这个课题上，真的做到了。

# wrapup.progress_none
source: No actions completed last time. Today is a fresh start.
zh_hans: 上次行动未完成，今天重新开始。

# wrapup.progress_partial
source: On %@, you built real change.
zh_hans: 你在「%@」这个课题上，积累了真实的改变。

# wrapup.title
source: Last wrap-up
zh_hans: 上次收尾

source: You have %d refresh(es) remaining today.
zh_hans: 你今天还有 %d 次更新机会。

source: You've used all 2 refreshes for today. Come back tomorrow to update your rhythm. We're also working on a subscription plan with more access. Thank you for your patience.
zh_hans: 今天的更新次数已用完，明天再来探索新的节奏吧。我们也在筹备订阅计划，届时将带来更多次数。感谢你的耐心。

# zodiac.aquarius
source: Aquarius
zh_hans: 水瓶

# zodiac.aries
source: Aries
zh_hans: 白羊

# zodiac.cancer
source: Cancer
zh_hans: 巨蟹

# zodiac.capricorn
source: Capricorn
zh_hans: 摩羯

# zodiac.gemini
source: Gemini
zh_hans: 双子

# zodiac.leo
source: Leo
zh_hans: 狮子

# zodiac.libra
source: Libra
zh_hans: 天秤

# zodiac.pisces
source: Pisces
zh_hans: 双鱼

# zodiac.sagittarius
source: Sagittarius
zh_hans: 射手

# zodiac.scorpio
source: Scorpio
zh_hans: 天蝎

# zodiac.taurus
source: Taurus
zh_hans: 金牛

# zodiac.virgo
source: Virgo
zh_hans: 处女
